Revit 2027 API
BarTerminationsData.AsRebarShapeTerminationsData Method
 Creates a new instance of RebarShapeTerminationsData from this.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeTerminationsData AsRebarShapeTerminationsData()
Public Function AsRebarShapeTerminationsData As RebarShapeTerminationsData
public:
RebarShapeTerminationsData^ AsRebarShapeTerminationsData()
member AsRebarShapeTerminationsData : unit -> RebarShapeTerminationsData
Return Value
RebarShapeTerminationsData
 Returns a new instance of RebarShapeTerminationsData from this.
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace